package format

import "fmt"

func Integer() {
	var num int = 110
	PrintTitle("%b - 2進表記")
	fmt.Printf("%b\n", num)
	// ----------------------------------------
	// %b - 2進表記
	// ----------------------------------------
	// 1101110

	PrintTitle("%c - 対応するUnicodeコードポイントによって表される文字")
	fmt.Printf("%c\n", num)
	// ----------------------------------------
	// %c - 対応するUnicodeコードポイントによって表される文字
	// ----------------------------------------
	// n

	PrintTitle("%d - 10進表記")
	fmt.Printf("%d\n", num)
	// ----------------------------------------
	// %d - 10進表記
	// ----------------------------------------
	// 110

	PrintTitle("%o - 8進表記")
	fmt.Printf("%o\n", num)
	// ----------------------------------------
	// %o - 8進表記
	// ----------------------------------------
	// 156

	PrintTitle("%O - `0o`のprefixがついた8進表記")
	fmt.Printf("%O\n", num)
	// ----------------------------------------
	// %O - `0o`のprefixがついた8進表記
	// ----------------------------------------
	// 0o156

	PrintTitle("%q - Go構文で安全にエスケープされた単一引用符の文字リテラル")
	fmt.Printf("%q\n", num)
	// ----------------------------------------
	// %q - Go構文で安全にエスケープされた単一引用符の文字リテラル
	// ----------------------------------------
	// 'n'

	PrintTitle("%x - 16進表記（a-fの文字は小文字表記）")
	fmt.Printf("%x\n", num)
	// ----------------------------------------
	// %x - 16進表記（a-fの文字は小文字表記）
	// ----------------------------------------
	// 6e

	PrintTitle("%X - 16進表記（A-Fの文字は大文字表記）")
	fmt.Printf("%X\n", num)
	// ----------------------------------------
	// %X - 16進表記（A-Fの文字は大文字表記）
	// ----------------------------------------
	// 6E

	PrintTitle("%U - Unicodeフォーマット")
	fmt.Printf("%U\n", num)
	// ----------------------------------------
	// %U - Unicodeフォーマット
	// ----------------------------------------
	// U+006E

}
