package format

import "fmt"

func Pointer() {
	var num int = -123
	var ptr *int = &num
	PrintTitle("%p - アドレスを16進数表記で表示。先頭に0xが付く。")
	fmt.Printf("%p\n", ptr)
	// ----------------------------------------
	// %p - アドレスを16進数表記で表示。先頭に0xが付く。
	// ----------------------------------------
	// 0xc000016168

	PrintTitle("%b - アドレスを符号付き2進表記で表示")
	// fmt.Printf("%b\n", ptr)
	// ----------------------------------------
	// %b - アドレスを符号付き2進表記で表示
	// ----------------------------------------
	// 1100000000000000000000010110000101101000

	PrintTitle("%d - アドレスを10進表記で表示")
	fmt.Printf("%d\n", ptr)
	// ----------------------------------------
	// %d - アドレスを10進表記で表示
	// ----------------------------------------
	// 824633811304

	PrintTitle("%o - アドレスを8進表記で表示")
	fmt.Printf("%o\n", ptr)
	// ----------------------------------------
	// %o - アドレスを8進表記で表示
	// ----------------------------------------
	// 14000000260550

	PrintTitle("%x - アドレスを小文字を使う16進表記で表示")
	fmt.Printf("%x\n", ptr)
	// ----------------------------------------
	// %x - アドレスを小文字を使う16進表記で表示
	// ----------------------------------------
	// c000016168

	PrintTitle("%X - アドレスを大文字を使う16進表記で表示")
	fmt.Printf("%X\n", ptr)
	// ----------------------------------------
	// %X - アドレスを大文字を使う16進表記で表示
	// ----------------------------------------
	// C000016168

}
